import 'package:flutter/material.dart';

class HealthService extends StatelessWidget {
  const HealthService({super.key});

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      body: SafeArea(
        child: Container(
          padding: const EdgeInsets.all(10),
          margin: const EdgeInsets.only(bottom: 12),
          child: ListView(
              children:  [
                   const Text('بعض الأسئله الشائعه',style: TextStyle(fontSize: 28,fontWeight: FontWeight.w900),)
                    ,
                    const Divider(thickness: 3,endIndent: 20),
                     textTitle('أنا مريض وأحتاج إلى رعاية صحية. أين يمكنني الحصول عليه؟'),
                     textBody('تمنح وزارة الصحة والسكان المصرية وصول اللاجئين وطالبي اللجوء إلى جميع الخدمات الصحية المقدمة في مرافقها على قدم المساواة مع المواطنين المصريين. وهذا يعني أنه في معظم الحالات يمكنك الذهاب إلى أحد مرافق الرعاية الصحية الأولية وتلقي الرعاية هناك مجاناً أو بتكلفة يمكن تحملها.'),
                     textTitle('أنا أحتاج إلى خدمات صحية وقائية مثل التطعيمات لأولادي أو فحص للحمل. أين يمكنني أن أذهب؟'),
                     textBody('تقدم مثل هذه الخدمات مجاناً أو بتكلفة يمكن تحملها في مرافق الرعاية الصحية الأولية العامة للمواطنين المصريين واللاجئين وطالبي اللجوء.'),
                     textTitle('في حالة الطوارئ الطبية ماذا أفعل؟'),
                     textBody('توفر المستشفيات العامة الخدمات الصحية الطارئة الأساسية المنقذة للحياة للمصريين وكذلك اللاجئين وطالبي اللجوء مجانًا أو بتكلفة يمكن تحملها. أما بالنسبة للتدخلات المتقدمة أو دخول المستشفى لمدة تتجاوز 24 ساعة، فسوف تطلب المستشفى الدفع من الصريين وغير المصريين على حد سواء. للحصول على سيارة إسعاف للوصول إلى أقرب مستشفى تابعة لوزارة الصحة والسكان، اتصل على 123. تقدم وزارة الصحة والسكان المزيد من المشورة والدعم للأشخاص ذوي الاحتياجات الصحية الحرجة من خلال رقم 16474.'),
                     textTitle('لدي حالة مزمنة، لكن لا يمكنني الحصول على المساعدة في أحد مرافق الرعاية الصحية الأولية العامة أو لا أستطيع شراء الأدوية. ماذا يمكنني أن أفعل؟'),
                     textBody('لدى منظمة كاريتاس، شريك المفوضية في مجال الرعاية الصحية، عيادات في الإسكندرية ودمياط ومرسى مطروح والقاهرة الكبرى وأسوان. في هذه العيادات، يمكنك الحصول على استشارات مجانية ووصفات طبية للأدوية المدعومة وإحالات إلى فحوصات تشخيص مدعومة. ( انظر أسفل للتواصل)'),
                     textTitle('أنا حامل وأحتاج إلى فحوصات متخصصة بسبب مخاطر صحية لي و/أو لطفلي؟ أين يجب أن أذهب؟'),
                     textBody('يقدم كلاً من كاريتاس ومصر الملجأ، شركاء المفوضية في مجال الرعاية الصحية، خدمات صحية مجانية للنساء اللاتي يعانين من حالات حمل معقدة أو شديدة الخطورة.'),
                     textTitle('أنا حامل ولا أستطيع تحمل تكاليف الولادة في المستشفى. ماذا يمكنني أن أفعل؟'),
                     textBody('تقدم منظمة كاريتاس، شريك المفوضية في مجال الرعاية الصحية، الدعم النقدي لأي أمرأة لاجئة أو طالبة لجوء تلد في أحد مستشفيات وزارة الصحة والسكان. اتصل بعيادة كاريتاس لمعرفة المزيد. (انظر أسفل للتواصل)'),
                     textTitle('أحتاج إلى رعاية صحية في المستشفى ولكن لا أستطيع تحمل تكاليفها. ماذا أفعل؟'),
                     textBody('تقوم هيئة إنقاذ الطفولة، شريك المفوضية، بدفع تكاليف الرعاية في المستشفيات للأشخاص الذين يعانون من حالات طبية خطيرة.في حالات الطوارئ برجاء الاتصال بالخط الساخن لهيئة إنقاذ الطفولة:  \\ 01280770146 \\ 01280769456 \\ 01064833320 إذا لم تكن هناك حالة طارئة، فيجب أولاً أن يتم فحصك وإحالتك من قبل طبيب في كاريتاس (انظر أسفل للتواصل) '),
                     textTitle('أنا بحاجة إلى خدمات صحية متعلقة بفيروس نقص المناعة (الإيدز) أو الإصابة بالسل. أين يمكنني الحصول عليها؟'),
                     textBody('توفر وزارة الصحة والسكان علاج فيروس نقص المناعة (الإيدز) والسل مجانًا للاجئين وطالبي اللجوء في المستشفيات المتخصصة. لمزيد من المعلومات يمكنك الاتصال بالخط الساخن الخاص بفيروس نقص المناعة : 01100666471توفر مصر الملجأ، شريك المفوضية، خدمات إضافية ذات صلة مثل الاختبارات والمشورة وعلاج حالات العدوى الانتهازية. (انظر أسفل للتواصل)'),
                     textTitle('هل أحتاج أن أكون مسجلاً لدى المفوضية للحصول على الخدمات الصحية؟'),
                     textBody('لا تقوم مرافق الصحة العامة مثل مرافق الرعاية الصحية الأولية الخاصة بوزارة الصحة والسكان من التحقق من بطاقات المفوضية لتقديم خدمات الرعاية الصحية الأولية وينطبق نفس الشئ على خدمات الطوارئ التابعة لوزارة الصحة والسكان. ومع ذلك، للوصول إلى الخدمات الصحية الموضحة أعلاه والتي يقدمها شركاء المفوضية (كاريتاس، وهيئة إنقاذ الطفولة، ومصر الملجأ)، يجب عليك التسجيل لدى المفوضية.'),
                     textTitle('هل سأظل قادراً على الحصول على خدمات المفوضية إذا انتهت صلاحية بطاقة المفوضية الخاصة بي أو فقدتها؟'),
                     textBody('يمكنك دائماً الاتصال بالمفوضية وحجز موعد إذا أدركت أن بطاقة طالب اللجوء أو اللاجئ أو وثيقة اللجوء الخاصة بك قد انتهت صلاحيتها.وسيظل بإمكانك الحصول على الخدمات من خلال شركاء المفوضية المنفذين للرعاية الصحية (كاريتاس، ومصر الملجأ، وهيئة إنقاذ الطفولة).إذا لم تكن من حاملي أي من هذه البطاقات، سواء كانت سارية أو غير سارية أو قد تم إغلاق ملف، فلن تتمكن من الحصول على الخدمات المذكورة أعلاه من خلال شركاء المفوضية المنفذين.'),
              ],
          ),
        ),
      ),
    );
  }
  static Widget textTitle(String text){
    return Container(
      margin: const EdgeInsets.all(10),
      child: Text(text,softWrap: true, style: const TextStyle(fontSize: 25,fontWeight: FontWeight.w600,color: Colors.blue),),
    );
  }
  static Widget textBody(String text){
    return Text(text,selectionColor: Colors.red, softWrap: true,style:const TextStyle(fontSize: 20,fontStyle: FontStyle.italic,fontWeight: FontWeight.w400));
  }
}