import 'package:flutter/material.dart';
import 'package:theproject/view/services/health_service.dart';

class LearningService extends StatelessWidget {
  const LearningService({super.key});

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      body: SafeArea(
        child: Container(
          padding: const EdgeInsets.all(10),
          margin: const EdgeInsets.only(bottom: 12),
          child: ListView(
              children:  [
                   const Text('بعض الأسئله الشائعه',style: TextStyle(fontSize: 28,fontWeight: FontWeight.w900),)
                    ,
                    const Divider(thickness: 3,endIndent: 20),
                     HealthService.textTitle('ما هي الخيارات المتاحة لي لإرسال طفلي إلى المدرسة في مصر؟'),
                     HealthService.textBody('يمكن لطفلك الالتحاق بالمدرسة من خلال نظام التعليم الرسمي الذي يشمل المدارس الحكومية والمدارس الخاصة والدولية التي تشرف عليها وزارة التربية والتعليم.التعليم الحكومي متاح حاليًا للاجئين وملتمسي اللجوء السودانيين وجنوب السودانيين واليمنيين والسوريين على قدم المساواة مع المصريين، وتعمل المفوضية مع الحكومة لإدماج جنسيات اللاجئين الأخرى أيضًا.'),
                     HealthService.textTitle('كيف يقسم نظام التعليم المصري؟'),
                     HealthService.textBody('ينقسم نظام التعليم المصري إلى:'),
                     HealthService.textBody('تعليم الطفولة المبكرة'),
                     HealthService.textBody('التعليم الابتدائي (من الأول إلى السادس الابتدائي)'),
                     HealthService.textBody('التعليم الإعدادي(من الأول إلى الثالث الإعدادي )'),
                     HealthService.textBody('التعليم الثانوي (من الأول إلى الثالث الثانوي ) والذي ينقسم إلى فئتين:'),
                     HealthService.textBody('ثانوي عام وهو ثلاث سنوات دراسية'),
                     HealthService.textBody('ثانوي فني ويتراوح من 3 إلى 5 سنوات دراسية.'),
                     HealthService.textBody('يمكن للطلاب الذين اجتازوا بنجاح اختبارات الثانوية للأعوام الثلاثة التخرج والحصول على شهادة من المدرسة المصرية (شهادة الثانوية العامة).'),
                     HealthService.textTitle('أين أذهب لتسجيل طفلي في مدرسة في مصر؟'),
                     HealthService.textBody('يجب عليك التوجه إلى مكتب شؤون الطلاب بالمنطقة الإدارية التعليمية في منطقة إقامتك.'), 
                     HealthService.textTitle('ما هي المستندات التي يجب علي إحضارها؟'),
                     HealthService.textBody('تصريح إقامة ساري المفعول'),
                     HealthService.textBody('شهادة مدرسية معترف بها مسبقًا من المدرسة التي التحق بها طفلك قبل وصوله إلى مصر.'),
                     HealthService.textBody('إذا لم يكن لديك أي من السابق ذكره، فيجب أن يدخل طفلك اختبار تحديد المستوى الذي تقوم به وزارة التربية والتعليم.'),
                     HealthService.textTitle('ما هي اختبارات تحديد المستوى؟'),
                     HealthService.textBody('اختبارات تحديد المستوى هي اختبارات قصيرة يحتاج الطلاب الذين تلقوا تعليمهم خارج مصر إلى المرور بها لتحديد السنة الدراسية التي سيتم تسجيلهم فيها في نظام المدارس المصرية الرسمية.'),
                     HealthService.textBody('يجب على الطلاب التوجه إلى قسم شؤون الطلاب والامتحانات في الإدارة التعليمية في منطقة إقامتهم مع تصريح إقامة ساري المفعول. سيقوم القسم بترتيب اختبارات تحديد المستوى.'),
                     HealthService.textBody('اختبارات تحديد المستوى مجانية.'),
                     HealthService.textBody('يتلقى الطلاب الناجحون، الذين يجتازون الامتحان، رسالة “وافدين” توضح عمر الطفل المحدد من أجل إرساله إلى المدرسة. هذه الرسالة تساعد الأطفال في الالتحاق بالمدارس.'),
                     HealthService.textTitle('كيف أعرف ما إذا كانت شهادة المدرسة التي يحملها طفلي سيتم الاعتراف بها من قبل المدرسة؟'),
                     HealthService.textBody('يجب ألا يزيد عمر الشهادة المدرسية عن عامين. ويجب تقديمها إلى سلطات التعليم وسيحددون ما إذا كانت تعتبر معادلة للشهادات المدرسية المصرية أم لا.'), 
                     HealthService.textTitle('ماذا أفعل إذا واجهت صعوبات في تسجيل أطفالي في المدارس، لأنني لا أحمل تصريح إقامة؟'),
                     HealthService.textBody('يجب على الأشخاص المسجلين لدى المفوضية السامية للأمم المتحدة لشؤون اللاجئين والذين لا يستطيعون تسجيل أطفالهم في المدارس بسبب عدم وجود أي مما يلي: تصريح الإقامة أو بطاقة طالب اللجوء (البطاقة الصفراء) أو جوازات السفر:/nالحصول على خطاب مختوم من المدرسة يؤكد وجود مكان للطالب.مع هذا الخطاب ، انتقل إلى القسم التعليمي وختمه.التوجه إلى إدارة الجوازات والهجرة بالعباسية بالقاهرة. هناك، ستحصل على رقم يوضح متى تتوقع الحصول على الإقامة.باستخدام هذا الرقم، قم بإعداد نسخة من بطاقة التسجيل الخاصة بك في المفوضية ونسخة من الرسالة التي قدمتها المدرسة والتواصل مع الوزارة للحصول على استثناء حتى يتم منح الإقامة.لتجنب التأخير في إجراءات التسجيل لطفلك، يرجى إكمال إجراءات الإقامة في أقرب وقت ممكن.'), 
                     HealthService.textTitle('ما هو موقف الطلاب الذين لم يتلقوا أي تعليم من قبل؟'),
                     HealthService.textBody('يمكن تسجيل الطفل في الصف الأول الابتدائي بالمدارس العامة أو الخاصة حتى سن التاسعة، حسب جنسيته. إذا كان الطالب أكبر من تسع سنوات، فسيتعين عليه التسجيل في دورة واحدة لتعليم الكبار قبل التسجيل في المدرسة. بعد إكمال دورة تعليم الكبار بنجاح والحصول على شهادة محو أمية الكبار، يتم تسجيل الطالب مباشرة في السنة التحضيرية الأولى من خلال نظام التعليم المنزلي (منازل).'),
                     HealthService.textBody('ستمر الطالب في الدراسة من خلال نظام التعليم المنزلي، إلا إذا كان عمره يسمح له بالحضور المنتظم في المدرسة. في هذه الحالة، سيتم تسجيل الطالب في مدرسة عامة بناءً على توفر الأماكن.'),
                     HealthService.textTitle('كيف يمكن للطلاب التسجيل من خلال نظام التعليم المنزلي؟'),
                     HealthService.textBody('يجب على الطلاب التوجه إلى إدارة شؤون الطلاب بالمنطقة التعليمية في منطقة إقامتهم مع المستندات التالية:'),
                     HealthService.textBody('آخر شهادة تعليمية أو دليل على اجتيازها.'),
                     HealthService.textBody('وثائق/كروت المفوضية السامية للأمم المتحدة لشؤون اللاجئين.'),
                     HealthService.textBody('صورتان شخصيتان.'),
                     HealthService.textBody('سيقوم القسم بإحالتهم إلى المدرسة الأقرب إلى منزلهم، حيث سيتم تسجيلهم، ولكنهم يدرسون من المنزل ويأخذون امتحانات منتصف العام ونهايته في المدرسة.'),
                     HealthService.textTitle('هل تقدم المفوضية أي دعم مالي للتعليم؟'),
                     HealthService.textBody('نعم، تقدم المفوضية منحًا تعليمية لطالبي اللجوء واللاجئين في سن المدرسة المسجلين في المدارس العامة والخاصة والمجتمعية في مصر من خلال شريكها، هيئة الإغاثة الكاثوليكية . بناءً على معايير معينة وضعتها المفوضية ويعلن عنها في يونيو من كل عام، قد تكون مؤهلاً للحصول على منح تعليمية.'),
                     HealthService.textTitle('ما هو الدعم المتاح للأطفال ذوي الاحتياجات الخاصة في مصر؟'),
                     HealthService.textBody('تقدم المفوضية الدعم للأطفال ذوي الاحتياجات الخاصة من خلال شريكها المنفذ هيئة الإغاثة الكاثوليكية، والذي يقدم المشورة لتقييم احتياجات الطفل، وإذا لزم الأمر، قد يوفر دعمًا إضافيًا مثل إيجاد مدرسة مناسبة لهم أو منح تعليمية إضافية.'),
                     HealthService.textTitle('كيف يمكنني التقدم للدراسة الجامعية في مصر؟'),
                     HealthService.textBody('يبدأ التعليم ما بعد الثانوي والعالي في سن 18 عامًا. في مصر، يكون التعليم العالي متاحاً حاليًا للاجئين السوريين واليمنيين والسودانيين.'),
                     HealthService.textBody('تحدد وزارة التعليم العالي الاستثناءات من الرسوم الجامعية حسب الجنسية ونوع الشهادة الثانوية. يتم تجديد الاستثناءات سنويًا.'),
                     HealthService.textTitle('هل تقدم المفوضية الدعم المالي للتعليم الجامعي؟'),
                     HealthService.textBody('لا، لا تقدم المفوضية أي منح للتعليم الجامعي. ومع ذلك، يدعم الصندوق الألماني لمبادرة ألبرت أينشتاين الأكاديمية للاجئين (دافي) الطلاب المسجلين في الجامعات الحكومية. يتم الإعلان عن المعلومات المتعلقة بالبرنامج في وقت مبكر عندما يتم قبول دفعة جديدة.'),
                     HealthService.textTitle('ما هو برنامج كورسيرا للاجئين؟'),
                     HealthService.textBody('هو عبارة عن منصة مجانية عبر الإنترنت تضم دورات مختلفة في عدة مجالات منها (إدارة الأعمال، تسويق، لغة، برمجة، إلخ) مقدمة من جامعات مرموقة ومؤسسات أخرى حول العالم، ويتم تقديم شهادة عند الانتهاء من أي دورة.كورسيرا للاجئين'),
                     HealthService.textTitle('من يمكنه التقدم بطلب للتسجيل بالبرنامج؟'),
                     HealthService.textBody('يمكن للاجئين وطالبي اللجوء وكذلك المصريين الذين لديهم عنوان بريد إلكتروني ويمكنهم الاتصال بالإنترنت التقدم بطلبوكذلك هؤلاء الذين يمكنهم التسجيل وملء الطلب وإتمام البرنامج في أحد مراكز التعلم المجتمعية في المعادي ومدينة نصر. هذه الدعوة مفتوجة حاليًا لـ  200 من الشباب اللاجئين و طالبي اللجوء والمصريين الذين يتراوح أعمارهم بين 18- 35 عام فقط بأولوية التسجيل.'),
                     HealthService.textTitle('هل يمكن دراسة الدورات بلغات أخرى غير الإنجليزية؟'),
                     HealthService.textBody('نعم، بعض الدورات مترجمة إلى اللغة العربية، ولكن الامتحانات وكذلك معظم الدورات تكون باللغة الإنجليزية.'),
                     HealthService.textTitle('هل يحتاج اللاجئون الإتصال بالإنترنت للإستفادة من الدورات؟'),
                     HealthService.textBody('الإنترنت مطلوب فقط لتنزيل الدورة: بمجرد تنزيلها؛ يمكنك إكمال الدورة بدون الانترنت. نظرًا لوجود تطبيق كورسيرا أيضا، فإن الهاتف المحمول أو الأجهزة اللوحية كافية للحضور، فلا يلزم وجود أجهزة كمبيوتر.'),
                     HealthService.textBody('يمكنك أيضًا الإتصال بالإنترنت من خلال مراكز التعلم المجتمعي لدى المفوضية بالتعاون مع هيئة تير دي زوم في المعادي ومدينة نصر إذا تم اختيارك.'),
                     HealthService.textTitle('كيف يمكن التسجيل؟'),
                     HealthService.textBody('فقط قم بملء استمارة التقديم في هذا الرابط ، وسوف تتلقى اتصالاً إذا تم اختيارك: https://qrgo.page.link/YftWz'), 
                     HealthService.textTitle('أرقام التواصل في حال كان لديك أي أسئلة:'),
                     HealthService.textBody('مركز التعليم المجتمعي بالمعادى: 01028411101'),
                     HealthService.textBody('مركز التعليم المجتمعي بمدينة نصر: 01033680393'),
                        ]
                        ,
          ),
        ),
      ),
    );
  }
}