import 'package:flutter/material.dart';
import 'package:theproject/view/services/health_service.dart';

class RightsDuties extends StatelessWidget {
  const RightsDuties({super.key});

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      body: SafeArea(
        child: Container(
          padding: const EdgeInsets.all(10),
          margin: const EdgeInsets.only(bottom: 12),
          child: ListView(
              children:  [
                   const Text('بعض الأسئله الشائعه',style: TextStyle(fontSize: 28,fontWeight: FontWeight.w900),),
                    const Divider(thickness: 3,endIndent: 20),
                     HealthService.textTitle('ما هي حقوق اللاجئين؟'),
                     HealthService.textBody('مختلف الحقوق التي يتمتع بها طالبو اللجوء واللاجئون لأنهم يلتمسون صفة اللجوء أو لأنهم حصلوا على الحماية كونهم لاجئين، والتي تتحمل الدولة المضيفة مسؤولية ضمانها. هذه الحقوق منصوص عليها في اتفاقية اللاجئين ومعاهدات حقوق الإنسان. وتتناول هذه الحقوق إمكانية البقاء في البلد المضيف وعدم إعادتهم إلى بلدهم الأصلي (عدم الإعادة القسرية على سبيل المثال) والتعليم والرعاية الصحية والسكن والعمل والأسرة، من جملة أمور أخرى.'),
                     HealthService.textTitle('ما هو قانون اللجوء؟'),
                     HealthService.textBody('هو ما يجمع القانون الدولي العرفي والصكوك الدولية التي تحدد المعايير اللازمة لحماية اللاجئين. وتعتبر اتفاقية عام 1951 وبروتوكولها لعام 1967 المتعلقين بوضع اللاجئين حجر الأساس لقانون اللجوء. ويكمّل كل من القانون الدولي للجوء والقانون الدولي لحقوق الإنسان والقانون الإنساني الدولي بعضهم الآخر.'),
                     HealthService.textTitle('ما هو مبدأ عدم الرد؟'),
                     HealthService.textBody('إنه حق مهم بالنسبة للاجئين وطالبي اللجوء وغيرهم ممن يخشون على حياتهم أو حرياتهم. لهؤلاء الأشخاص الحق في عدم إبعادهم بأي شكل من الأشكال من قبل البلد المضيف إلى بلدهم الأصلي، أو إلى أي بلد آخر يمكنهم أن يتعرضوا فيه للخطر أو للأذى. هذا الحق، المسمى بمبدأ عدم الرد، مدوّن في اتفاقية اللاجئين وغيرها من معاهدات حقوق الإنسان. كما أنه جزء مما يسمى بالقانون الدولي العرفي، وبالتالي يجب أن تضمنه جميع البلدان.'),
                     HealthService.textTitle('ما هي حماية اللاجئين؟'),
                     HealthService.textBody('تشمل حماية اللاجئين جميع الأنشطة التي تهدف إلى تحقيق الاحترام الكامل لحقوق اللاجئين. وتشمل الحماية توفير بيئة مواتية لاحترام البشر ومنع أو التخفيف من الآثار المباشرة لنمط معيّن من الإساءة، واستعادة ظروف الحياة الكريمة من خلال التعويض وإعادة التأهيل.'),
                     HealthService.textTitle('هل يتمتع اللاجئون بحقوق الإنسان؟'),
                     HealthService.textBody('نعم، يتمتع اللاجئون بحقوق الإنسان. وتُفهم حقوق الإنسان عموماً على أنها الحقوق غير القابلة للتصرف والتي يستحقها الشخص لمجرد كونه إنساناً. وهي مبنيّة على المبادئ الأساسية للشموليّة والمساواة وعدم التمييز، وهي مكرّسة في المعاهدات وقواعد القانون الدولي العرفي والقوانين الوطنية والمعايير الأخرى التي تحددها وتساعد على ضمان التمتع الكامل بها. تنطبق حقوق الإنسان على جميع الأفراد، بما في ذلك كافة الأشخاص المشمولين بولاية المفوضية.'),
                     HealthService.textTitle('هل يستطيع اللاجئون السفر؟'),
                     HealthService.textBody('بصفتك لاجئاً أو شخصاً عديم الجنسية في أي دولة من الدول الأطراف في اتفاقية اللاجئين لعام 1951 أو اتفاقية انعدام الجنسية لعام 1954، فإنه يحق لك الحصول على “وثيقة سفر الاتفاقية” والتي يتم إصدارها لتحل محل جواز سفرك الوطني.'),
                     HealthService.textBody('بصفتك لاجئًا، فإن السفر برفقة “وثيقة سفر خاصة بالاتفاقية” يكون أكثر أماناً من السفر بجواز السفر الوطني، حيث أنك تتمتع بالحماية من العودة القسرية إلى بلدك الأصلي.'),
                     HealthService.textBody('من الناحية العمليّة، لا تُصدر جميع الدول وثائق سفر خاصة بالاتفاقية، على الرغم من التزامها بالقيام بذلك. وتصدر بعض الدول وثائق سفر أخرى للاجئين وعديمي الجنسية، مثل جوازات سفر للأجانب أو وثيقة هوية خاصة بالسفر.'),
                     HealthService.textBody('في بعض الدول، قد تساعدك المفوضية في الحصول على وثيقة سفر طارئة من اللجنة الدولية للصليب الأحمر عندما لا تتوفر لديك خيارات أخرى. وهذه الوثيقة صالحة لرحلة واحدة فقط.'),
                     ],
          ),
        ),
      ),
    );
  }
}